Revit 2027 API
ProjectPosition.NorthSouth Property
 North/South offset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NorthSouth { get; set; }
Public Property NorthSouth As Double
	Get
	Set
public:
property double NorthSouth {
	double get ();
	void set (double value);
}
member NorthSouth : float with get, set
Property Value
Double
Remarks
 The offset of the project location from the site location in the north/south direction. Measured in decimal feet.
See Also
Reference
ProjectPosition Class
Autodesk.Revit.DB Namespace